test/report_200t/statistics.json
{
  "POST /seckill/do/2" : {
    "transaction" : "POST /seckill/do/2",
    "sampleCount" : 11584,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 94.7748618784528,
    "medianResTime" : 83.0,
    "minResTime" : 4.0,
    "maxResTime" : 322.0,
    "pct1ResTime" : 205.0,
    "pct2ResTime" : 222.0,
    "pct3ResTime" : 254.0,
    "throughput" : 385.42671768424555,
    "receivedKBytesPerSec" : 80.17495269090001,
    "sentKBytesPerSec" : 125.50529108093495
  },
  "POST /seckill/do/1" : {
    "transaction" : "POST /seckill/do/1",
    "sampleCount" : 11625,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 93.3437419354844,
    "medianResTime" : 81.0,
    "minResTime" : 4.0,
    "maxResTime" : 330.0,
    "pct1ResTime" : 204.0,
    "pct2ResTime" : 222.0,
    "pct3ResTime" : 253.0,
    "throughput" : 387.02267203782003,
    "receivedKBytesPerSec" : 80.4590354188168,
    "sentKBytesPerSec" : 126.02549303775344
  },
  "POST /seckill/do/4" : {
    "transaction" : "POST /seckill/do/4",
    "sampleCount" : 11551,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 95.22933079387063,
    "medianResTime" : 84.0,
    "minResTime" : 4.0,
    "maxResTime" : 333.0,
    "pct1ResTime" : 205.0,
    "pct2ResTime" : 222.0,
    "pct3ResTime" : 253.47999999999956,
    "throughput" : 384.9050316561146,
    "receivedKBytesPerSec" : 80.13162279240252,
    "sentKBytesPerSec" : 125.33520727465844
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 58239,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 94.63967444495871,
    "medianResTime" : 92.0,
    "minResTime" : 4.0,
    "maxResTime" : 333.0,
    "pct1ResTime" : 207.0,
    "pct2ResTime" : 223.0,
    "pct3ResTime" : 251.0,
    "throughput" : 1937.7474629845283,
    "receivedKBytesPerSec" : 403.25484008484443,
    "sentKBytesPerSec" : 630.9833014473465
  },
  "POST /seckill/do/3" : {
    "transaction" : "POST /seckill/do/3",
    "sampleCount" : 11686,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 94.58454561013188,
    "medianResTime" : 83.0,
    "minResTime" : 4.0,
    "maxResTime" : 301.0,
    "pct1ResTime" : 205.0,
    "pct2ResTime" : 222.0,
    "pct3ResTime" : 253.0,
    "throughput" : 389.4165083808191,
    "receivedKBytesPerSec" : 81.03955532090373,
    "sentKBytesPerSec" : 126.80544794894865
  },
  "POST /seckill/do/5" : {
    "transaction" : "POST /seckill/do/5",
    "sampleCount" : 11793,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 95.2614262698212,
    "medianResTime" : 85.0,
    "minResTime" : 4.0,
    "maxResTime" : 332.0,
    "pct1ResTime" : 204.0,
    "pct2ResTime" : 222.0,
    "pct3ResTime" : 253.0599999999995,
    "throughput" : 392.87736949062196,
    "receivedKBytesPerSec" : 81.84535273761536,
    "sentKBytesPerSec" : 127.93082617766599
  }
}