test/report_500t/statistics.json
{
  "POST /seckill/do/2" : {
    "transaction" : "POST /seckill/do/2",
    "sampleCount" : 7508,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 235.9605753862547,
    "medianResTime" : 226.0,
    "minResTime" : 5.0,
    "maxResTime" : 550.0,
    "pct1ResTime" : 365.0,
    "pct2ResTime" : 390.0,
    "pct3ResTime" : 457.0,
    "throughput" : 370.69220894638096,
    "receivedKBytesPerSec" : 77.18922805371778,
    "sentKBytesPerSec" : 120.70440753986865
  },
  "POST /seckill/do/1" : {
    "transaction" : "POST /seckill/do/1",
    "sampleCount" : 7550,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 234.34807947019922,
    "medianResTime" : 223.0,
    "minResTime" : 5.0,
    "maxResTime" : 561.0,
    "pct1ResTime" : 365.90000000000055,
    "pct2ResTime" : 394.0,
    "pct3ResTime" : 470.0,
    "throughput" : 372.71066791726315,
    "receivedKBytesPerSec" : 77.55941618946537,
    "sentKBytesPerSec" : 121.36651450733079
  },
  "POST /seckill/do/4" : {
    "transaction" : "POST /seckill/do/4",
    "sampleCount" : 7523,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 238.55842084274806,
    "medianResTime" : 232.0,
    "minResTime" : 5.0,
    "maxResTime" : 558.0,
    "pct1ResTime" : 368.0,
    "pct2ResTime" : 394.0,
    "pct3ResTime" : 452.0,
    "throughput" : 371.3961295418641,
    "receivedKBytesPerSec" : 77.42478308896129,
    "sentKBytesPerSec" : 120.93344834555194
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 37464,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 236.2157004057216,
    "medianResTime" : 246.0,
    "minResTime" : 5.0,
    "maxResTime" : 567.0,
    "pct1ResTime" : 366.0,
    "pct2ResTime" : 386.0,
    "pct3ResTime" : 455.0,
    "throughput" : 1849.4347632917018,
    "receivedKBytesPerSec" : 385.3093220861924,
    "sentKBytesPerSec" : 602.2187160611146
  },
  "POST /seckill/do/3" : {
    "transaction" : "POST /seckill/do/3",
    "sampleCount" : 7340,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 235.70940054495935,
    "medianResTime" : 227.0,
    "minResTime" : 6.0,
    "maxResTime" : 567.0,
    "pct1ResTime" : 365.0,
    "pct2ResTime" : 391.0,
    "pct3ResTime" : 462.0,
    "throughput" : 363.5823261343372,
    "receivedKBytesPerSec" : 75.74904298035962,
    "sentKBytesPerSec" : 118.39156267027442
  },
  "POST /seckill/do/5" : {
    "transaction" : "POST /seckill/do/5",
    "sampleCount" : 7543,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 236.49516107649475,
    "medianResTime" : 227.0,
    "minResTime" : 5.0,
    "maxResTime" : 565.0,
    "pct1ResTime" : 366.0,
    "pct2ResTime" : 391.7999999999993,
    "pct3ResTime" : 457.0,
    "throughput" : 372.38349131121646,
    "receivedKBytesPerSec" : 77.66395797850019,
    "sentKBytesPerSec" : 121.25588367335604
  }
}