test/report_50t/statistics.json
{
  "POST /seckill/do/2" : {
    "transaction" : "POST /seckill/do/2",
    "sampleCount" : 22640,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.50861307420505,
    "medianResTime" : 23.0,
    "minResTime" : 4.0,
    "maxResTime" : 173.0,
    "pct1ResTime" : 44.0,
    "pct2ResTime" : 48.0,
    "pct3ResTime" : 56.0,
    "throughput" : 378.1337163663087,
    "receivedKBytesPerSec" : 78.61518143090375,
    "sentKBytesPerSec" : 123.1308254816445
  },
  "POST /seckill/do/1" : {
    "transaction" : "POST /seckill/do/1",
    "sampleCount" : 22615,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.401812956002615,
    "medianResTime" : 23.0,
    "minResTime" : 4.0,
    "maxResTime" : 171.0,
    "pct1ResTime" : 44.0,
    "pct2ResTime" : 48.0,
    "pct3ResTime" : 56.0,
    "throughput" : 377.31284515407845,
    "receivedKBytesPerSec" : 78.42083471499241,
    "sentKBytesPerSec" : 122.8652715559671
  },
  "POST /seckill/do/4" : {
    "transaction" : "POST /seckill/do/4",
    "sampleCount" : 22602,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.345898593044833,
    "medianResTime" : 23.0,
    "minResTime" : 4.0,
    "maxResTime" : 177.0,
    "pct1ResTime" : 44.0,
    "pct2ResTime" : 48.0,
    "pct3ResTime" : 55.0,
    "throughput" : 377.51795557040253,
    "receivedKBytesPerSec" : 78.57473745197929,
    "sentKBytesPerSec" : 122.92843804806247
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 112623,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.438036635500854,
    "medianResTime" : 23.0,
    "minResTime" : 4.0,
    "maxResTime" : 177.0,
    "pct1ResTime" : 44.0,
    "pct2ResTime" : 47.0,
    "pct3ResTime" : 54.0,
    "throughput" : 1878.9289289289288,
    "receivedKBytesPerSec" : 390.8639596627878,
    "sentKBytesPerSec" : 611.8309064272606
  },
  "POST /seckill/do/3" : {
    "transaction" : "POST /seckill/do/3",
    "sampleCount" : 22405,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.320151751841014,
    "medianResTime" : 23.0,
    "minResTime" : 4.0,
    "maxResTime" : 168.0,
    "pct1ResTime" : 44.0,
    "pct2ResTime" : 48.0,
    "pct3ResTime" : 55.0,
    "throughput" : 373.84035239938595,
    "receivedKBytesPerSec" : 77.76717258726556,
    "sentKBytesPerSec" : 121.73420566746479
  },
  "POST /seckill/do/5" : {
    "transaction" : "POST /seckill/do/5",
    "sampleCount" : 22361,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.614462680560006,
    "medianResTime" : 23.0,
    "minResTime" : 4.0,
    "maxResTime" : 175.0,
    "pct1ResTime" : 44.0,
    "pct2ResTime" : 48.0,
    "pct3ResTime" : 55.0,
    "throughput" : 373.66732395307645,
    "receivedKBytesPerSec" : 77.80718718145283,
    "sentKBytesPerSec" : 121.67469061758464
  }
}